# Lab 01: Configure IP ACLs to Mitigate Attacks

## ðŸŽ¯ Objective (Lab 1)
â€¢  Verify connectivity among devices before firewall configuration.
â€¢  Use ACLs to ensure remote access to the routers is available only from management station PC-C.
â€¢  Configure ACLs on R1 and R3 to mitigate attacks.
â€¢  Verify ACL functionality.

## ðŸ›  Steps Taken (Task 1)
1. set up the topology

2. Configured devices in accordance with presented addressing table
| Device   | Interface    | IP Address  | Subnet Mask     | Default Gateway | Switch Port |
| -------- | ------------ | ----------- | --------------- | --------------- | ----------- |
| **R1**   | G0/1         | 192.168.1.1 | 255.255.255.0   | N/A             | S1 F0/5     |
|          | S0/0/0 (DCE) | 10.1.1.1    | 255.255.255.252 | N/A             | N/A         |
|          | S0/0/0       | 10.1.1.2    | 255.255.255.252 | N/A             | N/A         |
| **R2**   | S0/0/1 (DCE) | 10.2.2.2    | 255.255.255.252 | N/A             | N/A         |
|          | Lo0          | 192.168.2.1 | 255.255.255.0   | N/A             | N/A         |
| **R3**   | G0/1         | 192.168.3.1 | 255.255.255.0   | N/A             | S3 F0/5     |
|          | S0/0/1       | 10.2.2.1    | 255.255.255.252 | N/A             | N/A         |
| **PC-A** | NIC          | 192.168.1.3 | 255.255.255.0   | 192.168.1.1     | S1 F0/6     |
| **PC-C** | NIC          | 192.168.3.3 | 255.255.255.0   | 192.168.3.1     | S3 F0/18    |

3. From PC-A, verify connectivity to PC-C and R2.
-ping 192.168.3.3
-SERVER> ssh -l SSHadmin 192.168.2.1

4. From PC-C, verify connectivity to PC-A and R2.
-ping 192.168.1.3
-PC> ssh -l SSHadmin 192.168.2.1

## ðŸ“¸ Screenshots
screenshots(58,59,60)

## ðŸ›  Steps Taken (Task 2)

1. Use the access-list command to create a numbered IP ACL on R1, R2, and R3.
-R1(config)# access-list 10 permit host 192.168.3.3
R2(config)# access-list 10 permit host 192.168.3.3
R3(config)# access-list 10 permit host 192.168.3.3

2. Apply ACL 10 to ingress traffic on the VTY lines.
Use the access-class command to apply the access list to incoming traffic on the VTY lines.
- line vty 0 2
-R1(config-line)# access-class 10 in
R2(config-line)# access-class 10 in
R3(config-line)# access-class 10 in

3. Verify exclusive access from management station PC-C.
. Establish an SSH session to 192.168.2.1 from PC-C (should be successful).
-PC> ssh â€“l SSHadmin 192.168.2.1

.Establish an SSH session to 192.168.2.1 from PC-A (should fail).

## ðŸ“¸ Screenshots
Screenshots(61)

## ðŸ›  Steps Taken (Task 3)

1. Configure ACL 120 to specifically permit and deny the specified traffic.
-R1(config)# access-list 120 permit udp any host 192.168.1.3 eq domain
R1(config)# access-list 120 permit tcp any host 192.168.1.3 eq smtp
R1(config)# access-list 120 permit tcp any host 192.168.1.3 eq ftp
R1(config)# access-list 120 deny tcp any host 192.168.1.3 eq 443
R1(config)# access-list 120 permit tcp host 192.168.3.3 host 10.1.1.1 eq 22

2. Apply the ACL to interface S0/0/0.

-R1(config)# interface s0/0/0
R1(config-if)# ip access-group 120 in

3. Verify that PC-C cannot access PC-A via HTTPS using the web browser.

4. Modify an Existing ACL on R1
-Permit ICMP echo replies and destination unreachable messages from the outside network (relative to R1). Deny all other incoming ICMP packets.

-Make any necessary changes to ACL 120 to permit and deny the specified traffic.
.Use the access-list command to create a numbered IP ACL.
-R1(config)# access-list 120 permit icmp any any echo-reply
R1(config)# access-list 120 permit icmp any any unreachable
R1(config)# access-list 120 deny icmp any any

## ðŸ“¸ Screenshots
Screenshots(62)

## ðŸ›  Steps Taken (Task 4)

1. Configure ACL 110 to permit only traffic from the inside network
-R3(config)# access-list 110 permit ip 192.168.3.0 0.0.0.255 any

2. Apply the ACL to interface G0/1.
.Use the ip access-group command to apply the access list to incoming traffic on interface G0/1.
-R3(config)# interface g0/1
R3(config-if)# ip access-group 110 in

3. Create a Numbered IP ACL 100 on R3
. On R3, block all packets containing the source IP address from the following pool of addresses: any RFC 1918 private addresses, 127.0.0.0/8, and any IP multicast address. Since PC-C is being used for remote administration, permit SSH traffic from the 10.0.0.0/8 network to return to the host PC-C.

. Configure ACL 100 to block all specified traffic from the outside network.
. You should also block traffic sourced from your own internal address space if it is not an RFC 1918 address. In this activity, your internal address space is part of the private address space specified in RFC 1918.
. Use the access-list command to create a numbered IP ACL.
-R3(config)# access-list 100 permit tcp 10.0.0.0 0.255.255.255 eq 22 host 192.168.3.3 
R3(config)# access-list 100 deny ip 10.0.0.0 0.255.255.255 any
R3(config)# access-list 100 deny ip 172.16.0.0 0.15.255.255 any
R3(config)# access-list 100 deny ip 192.168.0.0 0.0.255.255 any
R3(config)# access-list 100 deny ip 127.0.0.0 0.255.255.255 any
R3(config)# access-list 100 deny ip 224.0.0.0 15.255.255.255 any
R3(config)# access-list 100 permit ip any any

4. Apply the ACL to interface Serial 0/0/1
-R3(config)# interface s0/0/1
R3(config-if)# ip access-group 100 in

5.  Confirm that the specified traffic entering interface Serial 0/0/1 is handled correctly.
.  From the PC-C command prompt, ping the PC-A server. The ICMP echo replies are blocked by the ACL since they are sourced from the 192.168.0.0/16 address space.

.  Establish an SSH session to 192.168.2.1 from PC-C (should be successful).

## ðŸ“¸ Screenshots
Screenshots(63)
