# Lab 01: Configure AAA Authentication on Cisco Routers

## ğŸ¯ Objective

â€¢  Configure a local user account on R1 and configure authenticate on the console and vty lines using local AAA. (Task 1)
â€¢  Configure Local AAA Authentication for vty Lines on R1 (Task 2)
â€¢  Configure server-based AAA authentication using TACACS+. (Task 3)
â€¢  Configure server-based AAA authentication using RADIUS. (Task 4)


## ğŸ›  Steps Taken (Task 1)
1. set up the topology

2. Configured devices in accordance with presented addressing table
| Device             | Interface    | IP Address  | Subnet Mask     | Default Gateway | Switch Port |
| ------------------ | ------------ | ----------- | --------------- | --------------- | ----------- |
| **R1**             | G0/1         | 192.168.1.1 | 255.255.255.0   | N/A             | S1 F0/1     |
|                    | S0/0/0 (DCE) | 10.1.1.2    | 255.255.255.252 | N/A             | N/A         |
| **R2**             | G0/0         | 192.168.2.1 | 255.255.255.0   | N/A             | S2 F0/2     |
|                    | S0/0/0       | 10.1.1.1    | 255.255.255.252 | N/A             | N/A         |
|                    | S0/0/1 (DCE) | 10.2.2.1    | 255.255.255.252 | N/A             | N/A         |
| **R3**             | G0/1         | 192.168.3.1 | 255.255.255.0   | N/A             | S3 F0/5     |
|                    | S0/0/1       | 10.2.2.2    | 255.255.255.252 | N/A             | N/A         |
| **TACACS+ Server** | NIC          | 192.168.2.2 | 255.255.255.0   | 192.168.2.1     | S2 F0/6     |
| **RADIUS Server**  | NIC          | 192.168.3.2 | 255.255.255.0   | 192.168.3.1     | S3 F0/1     |
| **PC-A**           | NIC          | 192.168.1.3 | 255.255.255.0   | 192.168.1.1     | S1 F0/2     |
| **PC-B**           | NIC          | 192.168.2.3 | 255.255.255.0   | 192.168.2.1     | S2 F0/1     |
| **PC-C**           | NIC          | 192.168.3.3 | 255.255.255.0   | 192.168.3.1     | S3 F0/18    |

- to give the routers multiple ports for serial cable connectivity. I turned off the routers and added an HWIC-2T cover and switched them back on 

3. Configure OSPF MD5 authentication and MD5 key for all the routers in area 0.
.Router 1
-conf t
router ospf 1
 router-id 1.1.1.1
 network 192.168.1.0 0.0.0.255 area 0
 network 10.1.1.0 0.0.0.3 area 0
exit

! Enable MD5 Authentication on the serial link
interface s0/1/0
 ip ospf authentication message-digest
 ip ospf message-digest-key 1 md5 cisco123
exit

.Router 2
conf t
router ospf 1
 router-id 2.2.2.2
 network 10.1.1.0 0.0.0.3 area 0
 network 10.2.2.0 0.0.0.3 area 0
exit

interface s0/1/0
 ip ospf authentication message-digest
 ip ospf message-digest-key 1 md5 cisco123
exit

interface s0/1/1
 ip ospf authentication message-digest
 ip ospf message-digest-key 1 md5 cisco123
exit

.Router 3
conf t
router ospf 1
 router-id 3.3.3.3
 network 192.168.3.0 0.0.0.255 area 0
 network 10.2.2.0 0.0.0.3 area 0
exit

interface s0/1/1
 ip ospf authentication message-digest
 ip ospf message-digest-key 1 md5 cisco123
exit

4.Verify OSPF route is working 
-show ip ospf neighbor (on each router)

5. Ping from PC-A to PC-B. 
â€¢  Ping from PC-A to PC-C.
â€¢  Ping from PC-B to PC-C.

6. Configure a local username on R1
- R1(config)# username Admin1 previlege 15 secret admin1pa55

7. Enable AAA on R1 and configure AAA authentication for the console login to use the local database
-R1(config)# aaa new-model
R1(config)# aaa authentication login default local

8. Enable AAA on R1 and configure AAA authentication for the console login to use the default method list
-R1(config)# line console 0
R1(config-line)# login authentication default
R1(config-line)# end

## ğŸ“¸ Screenshots
Screenshots (27,28,29,30)

## ğŸ›  Steps Taken (Task 2)

1. Configure domain name and crypto key for use with SSH
-R1(config)# ip domain-name ccnasecurity.com
R1(config)# crypto key generate rsa
-choose 1024 bit when prompted "How many bits in the modulus [512]:"

2. Configure a named list called SSH-LOGIN to authenticate logins using local AAA
-R1(config)# aaa authentication login SSH-LOGIN local

3. Configure the vty lines to use the named AAA method and only allow SSH for remote access.
-R1(config)# line vty 0 4
R1(config-line)# login authentication SSH-LOGIN
R1(config-line)# transport input ssh
R1(config-line)# end

4. Verify the AAA authentication method
PC> ssh -l Admin1 192.168.1.1
Open
Password: admin1pa55

## ğŸ›  Steps Taken (Task 3)

1. Configure a backup local database entry called Admin
-R2(config)# username Admin2 secret admin2pa55

2. Configure client name, client IP, secret, and server type, on the TACACS+ Server through AAA under the services menu

3. Configure the AAA TACACS server IP address and secret key on R2
-R2(config)# tacacs-server host 192.168.2.2
R2(config)# tacacs-server key tacacspa55

4. Enable AAA on R2 and configure all logins to authenticate using the AAA TACACS+ server
-R2(config)# aaa new-model
R2(config)# aaa authentication login default group tacacs+ local

5. Configure AAA authentication for console login to use the default AAA authentication method
-R2(config)# line console 0
R2(config-line)# login authentication default

6. Verify the AAA authentication method
-R2# exit
-Try to log back in to R2

## ğŸ“¸ Screenshots
Screenshots(31,32)

## ğŸ›  Steps Taken (Task 4)

1. Configure domain name and crypto key for use with SSH
-R2(config)# ip domain-name ccnasecurity.com
R2(config)# crypto key generate rsa
-choose 1024 bit when prompted "How many bits in the modulus [512]:"

2. Configure a named list called SSH-LOGIN to authenticate logins using local AAA
-R2(config)# aaa authentication login SSH-LOGIN local

3. Configure the vty lines to use the named AAA method and only allow SSH for remote access.
-R2(config)# line vty 0 4
R2(config-line)# login authentication SSH-LOGIN
R2(config-line)# transport input ssh
R2(config-line)# end

4. Verify the AAA authentication method
PC> ssh -l Admin2 192.168.2.1
Open
Password: admin2pa55


## ğŸ›  Steps Taken (Task 5)

1. Configure a backup local database entry called Admin
-R3(config)# username Admin3 secret admin3pa55

2. Configure client name, client IP, secret, and server type, on the RADIUS Server through AAA under the services menu

3. Configure the AAA RADIUS server IP address and secret key on R2
-R3(config)# radius-server host 192.168.3.2
R3(config)# radius-server key radiuspa55

4. Enable AAA on R3 and configure all logins to authenticate using the AAA RADIUS server
-R3(config)# aaa new-model
R3(config)# aaa authentication login default group radius local

5. Configure AAA authentication for console login to use the default AAA authentication method
-R3(config)# line console 0
R3(config-line)# login authentication default

6. Verify the AAA authentication method
-R3# exit
-Try to log back in to R3

## ğŸ“¸ Screenshots
Screenshots(34,33)

## ğŸ›  Steps Taken (Task 6)

1. Configure domain name and crypto key for use with SSH
-R3(config)# ip domain-name ccnasecurity.com
R3(config)# crypto key generate rsa
-choose 1024 bit when prompted "How many bits in the modulus [512]:"

2. Configure a named list called SSH-LOGIN to authenticate logins using local AAA
-R3(config)# aaa authentication login SSH-LOGIN local

3. Configure the vty lines to use the named AAA method and only allow SSH for remote access.
-R3(config)# line vty 0 4
R3(config-line)# login authentication SSH-LOGIN
R3(config-line)# transport input ssh
R3(config-line)# end

4. Verify the AAA authentication method
PC> ssh -l Admin3 192.168.3.1
Open
Password: admin3pa55

## ğŸ“š Key Learnings

